liren197968/SweepRobot/Stm32F4/KeilMdk5Project/Inc/gpio.h
/**
  ******************************************************************************
  * File Name          : gpio.h
  * Description        : This file contains all the functions prototypes for
  *                      the gpio
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __gpio_H
#define __gpio_H
#ifdef __cplusplus
extern "C" {
#endif

    /* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "main.h"

/* USER CODE BEGIN Includes */
#define ROC_PCA9685_A_EN_PIN                GPIO_PIN_2
#define ROC_PCA9685_A_EN_GPIO_PORT          GPIOC
#define ROC_PCA9685_B_EN_PIN                GPIO_PIN_3
#define ROC_PCA9685_B_EN_GPIO_PORT          GPIOC
#define ROC_PCA9685_C_EN_PIN                GPIO_PIN_3
#define ROC_PCA9685_C_EN_GPIO_PORT          GPIOC

#define ROC_DEBUG_LED_PIN                   GPIO_PIN_8
#define ROC_DEBUG_LED_GPIO_PORT             GPIOA
#define ROC_ROBOT_BATTERY_ADC_PIN           GPIO_PIN_4
#define ROC_ROBOT_BATTERY_ADC_PORT          GPIOA

#define ROC_TFTLCD_DC_PIN                   GPIO_PIN_2
#define ROC_TFTLCD_DC_PORT                  GPIOB
#define ROC_TFTLCD_RST_PIN                  GPIO_PIN_12
#define ROC_TFTLCD_RST_PORT                 GPIOB

#define ROC_BEEPER_CTRL_PIN                 GPIO_PIN_15
#define ROC_BEEPER_GPIO_PORT                GPIOA

#define ROC_MOTOR_IN1_PIN                   GPIO_PIN_2
#define ROC_MOTOR_IN2_PIN                   GPIO_PIN_12
#define ROC_MOTOR_IN3_PIN                   GPIO_PIN_0
#define ROC_MOTOR_IN4_PIN                   GPIO_PIN_1
#define ROC_MOTOR_GPIO_PORT1                GPIOB
#define ROC_MOTOR_GPIO_PORT2                GPIOA

#define ROC_ROBOT_RELAY_PIN                 GPIO_PIN_6
#define ROC_ROBOT_RELAY_PORT                GPIOC

/* USER CODE END Includes */

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

void MX_GPIO_Init(void);

/* USER CODE BEGIN Prototypes */

/* USER CODE END Prototypes */

#ifdef __cplusplus
}
#endif
#endif /*__ pinoutConfig_H */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
